}
# Тестирование интернет-магазина  

## Описание проекта  
Проведено тестирование веб-приложения [интернет-магазина](https://intern.demoshopping.ru/)  

---

## Цель  
Проверить основной пользовательский функционал и выявить дефекты.  

---

## Что тестировалось  
- регистрация и авторизация  
- корзина  
- оформление заказа  
- API запросы  

---

## Инструменты    
- Postman  
- Google Sheets  

---

## Что было сдлеано:
- Определены тестовые данные
- Чек-Лист
- Тест кейс
- Отчет о дефектах

---
## Тестовая документация  

[Тестовая документация](https://docs.google.com/spreadsheets/d/1lSh7kXoRekM788Yq3C7qULEVaR-R_hgws8SYLZ1nC-U/edit?usp=sharing)  

---

## Найденные дефекты  
Найдено 7 дефектов:
- 1 функциональный
- 6 UI
---

## Вывод  
Приложение имеет критические проблемы в процессе оформления заказа и регистрации.
